{

    "name": "Colombia Narino Buesaco",
    "region": "Central America",
    "description": "Our head of green coffee sourcing, Emmett, went to southern Colombia last month to pick out some interesting Colombian coffees. He was based in the Nariño region in the town of Buesaco. With Royal Coffee NY (importer) and Pergamino Cafe (exporter) they toured many of the farms in the region to get a sense of how coffee was changing in Colombia. In Narino coffee is everywhere, seemingly everyone grows it or is a part of the process. Every time you get in a jeep to drive to a farm there's coffee being dried on the side of the street or weighed down trucks bringing beans to the warehouse. But craft coffee is becoming a bigger deal in this behemoth in the coffee industry. With fantastic coffeeshops like, Amor Perfecto, offering region-specific brews and sourcing only Colombian beans you get a feeling that Colombian coffee farmers are starting to care about coffee processing and taste while still bolstering production. The Alianza Cafe is a co-op of small growers with warehousing in the town of Buesaco where Emmett spent time sourcing this fantastic coffee. These small size farmers take extreme care in their harvests resulting in a blend that is dynamic and very well balanced. These farmers have trees of the Caturra, Typica and Colombia varietal. But they're experimenting with Bourbon, red and yellow, as well as Catuai, Castillo and Gesha to determine which grow best, are most resistant to disease and most importantly, which have superior taste! We picked this coffee over other lots that we tried because it has a brown sugar and caramel taste that really hit the spot. When we take it lighter, just out of 1st cracks we taste a nice juicy coffee with lemon-lime acidity, at the beginning of the sip and cocoa and caramelized sugar at the finish. This is where the coffee is most interesting but probably not the most drinkable. If you take it a little darker, to 2nd cracks you get slight citrus, milk chocolate, very smooth. Not the most complex Colombia we've ever had, but so easy to drink. If you want a dark roast Colombia, you are probably better off buying a less expensive bean, but if you accidentally take this one dark, it can handle it.",
    "notes": ""

}
