{

    "name": "Costa Rica Tarrazu La Minita",
    "region": "Central America",
    "description": "Reputed as one of the best coffees in the world, it scores as high as 95 at cuppings, beating out most Jamaican Blue Mountain and Konas and tasting more like an Island coffee than a Costa Rican. The farm boasts meticulously grown coffee, paying attention to every detail, and turning the profits into educating, caring for, and improving the lives of those living nearby. Only about 1,000 burlap bags a year are sold, and the beans branded as \"La Minita\" are only the top 18% of their total crop, after being sorted several times. It’s grown high enough that you can roast it as dark as you like, but that would be a shame. It’s best when roasted slowly; the beans are dense and require more heat than most. Just a snap or two into the second cracks you will find a low acidity, sweet grain, and refreshing juiciness. You can actually pull it out right after the 1st cracks without risk of sour or unpleasant acidity. My sweet spot is to give it about 45-60 seconds of slow heat past the ending of the 1st cracks, and that's where you find the subtle maple sweetness, slight sweet citrus, milk chocolate, slight floral notes, crisp clarity, and wonderful smoothness. It’s a coffee that you can brew and have sit there for an hour, and still not be bitter or astringent after it cooled down. The beans really are that perfect. If you’ve not heard or tried La Minita before, you really need to give it a try. The farm is officially Rainforest Alliance Certification. They did not have to make the slightest change to their farm to receive certification — they were already exceeding all of the guidelines for wildlife habitat, soil erosion, shade trees, conservationism, water use, etc. The amazing things the farm does for its workers and the community are limitless. Educations, social programs, medical assistance. The workers are PASSIONATE about the coffee, knowing they are growing some of the best coffee anywhere in the world.",
    "notes": "Roast it good ya dummy"

}
