{
    "name": "Mexico Chiapas Rosalba Tovia",
    "region": "Central America",
    "description": "Mexican coffee is not a favorite at our shop, but there are always exceptions, and this one deserves some love. We met the farmer Rosalba Cifuentes Tovia and was super impressed. First of all, let there be no mistake, she is in charge; and that is not a common situation in Mexico. She had three or four guys around and her husband helping her out, and she was calling the shots. Second, she is so excited about her coffee. We had to talk to her in Spanish, and the conversation didn't go smoothly, but you could tell how passionate she was about sharing her coffee with people who will appreciate it. Third, this is a single farm, single varietal (Bourbon), strictly high grown (4,000-5,000 feet altitude), well sorted, very fresh coffee. The two main regions of Mexican coffee are Chiapas and Oaxaca. Both can be nice, but the Chiapas is close to the border of Guatemala and in general has a better reputation than Oaxaca coffees. You want the ones high up the mountain, which this one is, in the town of Bella Vista. This Mexico coffee shares a lot of traits with a Guatemala Huehuetenango, which is right across the border from it. The lighter roasts are a little bit fruity (lemon, melon, apple) with a lot of complexity. It's a really dense bean and needs a lot of airflow. We had a couple of test roasts where the inside wasn't getting roasted enough, so we had to up the airflow. Medium roasts of this bean are so easy to drink. Not terribly complex, but so creamy, so sweet, almost like a toasted marshmallow, it just is gone before you know it. Maybe 5 to 10 seconds of 2nd cracks is the most you really want. You can take it darker than that for French Roast, but it's a little bit expensive for French Roast. You would generally be better off using a less expensive Peru or Uganda or Colombia, but this one certainly can handle it if that's what you're looking for. In general, I'd tell you to stay away from Mexican beans, but you don't want to miss this one."

}
